# Data 불러오기

Padas library import

In [7]:
import pandas as pd

Example data (3DP) load

In [99]:
data = pd.read_csv('Data/Example_data.txt', sep='\t', names=['time', 'ACCx', 'ACCy', 'ACCz', 'AE'])
# 동일한 방법
# data = pd.read_csv('Example_data.txt', delimiter='\t', header=None)
# data.columns = ['time', 'ACCx', 'ACCy', 'ACCz', 'AE']

data.head(5)
# data

       time      ACCx      ACCy      ACCz        AE
0  0.000000  0.000318  0.000190  0.000328  0.000691
1  0.000156  0.000386  0.000106  0.000283  0.000250
2  0.000312  0.000341  0.000143  0.000296  0.000862
3  0.000469  0.000257  0.000325  0.000257 -0.000276
4  0.000625  0.000278  0.000276  0.000305  0.000270

Data / Column type 확인

In [100]:
type(data)

pandas.core.frame.DataFrame

In [101]:
type(data.ACCx)

pandas.core.series.Series

In [29]:
s1 = pd.core.series.Series( [1, 2, 3])
s2 = pd.core.series.Series( ['one', 'two', 'three'])

pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three

### Column(Series)의 경우 list와 같이 취급 가능(?)

In [30]:
data.ACCx[1]

0.000386

# DataFrame 생성하기

### 딕셔너리 자료형의 DataFrame 생성

In [102]:
friend_dict_list = [
    {'name': 'John', 'age': 25, 'job': 'student'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]

df = pd.DataFrame(friend_dict_list)
df.head()

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [37]:
df = df[['name', 'age', 'job']]
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

OrderedDict 이용하여 column 순서 고정

In [39]:
from collections import OrderedDict

In [41]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
        
    ]
)

df = pd.DataFrame.from_dict(friend_ordered_dict)
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

### 리스트 자료형의 DataFrame 생성

In [42]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

column_name = ['name', 'age', 'job']

df = pd.DataFrame.from_records(friend_list, columns = column_name)
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [47]:
 friend_list = [
     ['name', ['John', 'Nate']],
     ['age', [20, 30]],
     ['job', ['student', 'teacher']]     
 ]
    
df = pd.DataFrame.from_items(friend_list)
df.head()

C:\Python\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  import sys

   name  age      job
0  John   20  student
1  Nate   30  teacher

# DataFrame 저장하기

In [51]:
friends = [{'name': 'Jone', 'age': 20, 'job': 'student'},
           {'name': 'Jenn', 'age': 30, 'job': None},
           {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends)
df = df[['name', 'age', 'job']]
df.head()

   name  age      job
0  Jone   20  student
1  Jenn   30     None
2  Nate   30  teacher

Default : Index = True / header = True

In [58]:
df.to_csv('./Data/friends.txt')
df.to_csv('./Data/friends2.csv', index = False, header = True)
df.to_csv('./Data/friends3.csv', index = True,  header = False, na_rep = '-')

# 데이터 선택/추출 등

In [74]:
friend_list = [
                ['name', ['John', 'Jenny', 'Nate']],
                ['age',  [20, 30, 30]],
                ['job',  ['student', 'developer', 'teacher']]
              ]

df = pd.DataFrame.from_items(friend_list)
df

C:\Python\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  import sys

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [66]:
df = df[1:3]
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [68]:
df = df.loc[ [0, 2] ]
df

C:\Python\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   name   age      job
0   NaN   NaN      NaN
2  Nate  30.0  teacher

## by column condition

In [81]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [80]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [79]:
df.query('age >= 20')

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [83]:
df[ (df.age > 25) & (df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

## Filter Column

###  by index

In [84]:
friend_list = [
    ['John', 20, 'studnet'],
    ['Jenn', 30, 'developer'],
    ['Nate', 30, 'teacher']
]

df = pd.DataFrame.from_records(friend_list)
df

      0   1          2
0  John  20    studnet
1  Jenn  30  developer
2  Nate  30    teacher

In [85]:
df.iloc[:,0:2]

      0   1
0  John  20
1  Jenn  30
2  Nate  30

In [86]:
df.iloc[0:2,0:2]

      0   1
0  John  20
1  Jenn  30

## by column name

In [88]:
df = pd.read_csv('Pandas_hms/data/friend_list_no_head.csv', header=None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [89]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [90]:
df.filter(items = ['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [91]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [94]:
df.filter(regex='e$', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [95]:
df.filter(regex='$', axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]